Revit 2027 API
AnalysisDisplayStyleDeformedShapeTextLabelType Enumeration
 Defines text visualization types for deformed shape settings of analysis display style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalysisDisplayStyleDeformedShapeTextLabelType
Public Enumeration AnalysisDisplayStyleDeformedShapeTextLabelType
public enum class AnalysisDisplayStyleDeformedShapeTextLabelType
type AnalysisDisplayStyleDeformedShapeTextLabelType
Members
Member name | Value | Description
ShowAll | 0 |  Show vector text label for each point
ShowNone | 1 |  Don't show deformed shape text labels
ShowPredefined | 2 |  Show deformed shape text label only for points that have flag ValueAtPointFlags::DisplayText
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace